#-*-coding:utf-8-*-
import csv

header=["学号","姓名","年龄","性别","成绩"]
rows=[
    {"姓名":"张三","学号":"s001","年龄":25,"性别":"男","成绩":99},
    {"学号":"s002","姓名":"周华健","年龄":55,"性别":"男","成绩":92},
    {"学号":"s003","姓名":"成龙","年龄":56,"性别":"男","成绩":100},
    {"学号":"s004","年龄":25,"性别":"女","姓名":"赵丽颖","成绩":89},
    {"学号":"s005","姓名":"范冰冰","年龄":30,"性别":"女","成绩":79},
    {"学号":"s006","姓名":"林心如","年龄":32,"性别":"女","成绩":95},
]


with open("stu1.csv","w") as f:
    csv_f=csv.DictWriter(f,header)
    csv_f.writeheader()
    csv_f.writerows(rows)
    print type(csv_f)